{"ignore":["love how you added the little callout for how you identified gender - both the copy inside and the design / placement of it","*   * LOVE IT SO MUCH","Tiny tweak: it says it reveals a fact, then the fact is half of the songs are by men, but im assuming its actually the second one, so just a little grammatical tweaking, like “while half of the songs…”","“Songs written by just women [or non-binary]...” <- might add that if the point is not men","Not sure i understand why this is being called out “Of those 187, only 13 were performed exclusively by men.” (i got it after talking with matt quickly,","","dumb question, but maybe not: when you call out “all too well (taylor’s version)” is the old version written by taylor and liz, the new version, or both?","taylor’s version = new version","all too well original version came out in 2012","not sure i love “this is getting ridiculous”","I think the labels here are too overwhelming and we should just have “only men” and “only women”","I still need to address your feedback on the box chart around performance and flow of that part.","There’s still a ton of data updating to do.","The long scroll needs a legend.","Mobile still needs to get done.","Wire up copy doc to the code","On the chart with boxes, it’s unclear who the writer is vs. the artist (pen icon might be too vague).","On the chart with boxes, names will be illegible on mobile.","Bug here","Kill first chart","Begin with in 2022—42 songs","This is what the average songwriting team looks like in 2022… 8 people (more than it used to be?), 6 men / 2 women (whatever it is)... the vast majority of teams include at least 1 man… in 2022, only 1 was written exclusively by women, Running Up that Hill”. And throughout you’re seeing illustrations of people in a room getting swapped in and out to match the numbers. I want to feel what a single room looks/feels like before we get to the zoomed out walls of mmfmfmfmffmf.","A slightly different way in, show 5 different writers rooms with illustrations for well known songs and be like “what do these have in common? There’s at least one man in the room” (kind of like the intro to Jan’s country radio piece). Then “in 2022, only 1 song was written exclusively by women…”","* Counter","I love the counter. I think it would be nice when you got to the end and the counter stopped that it showed the percentage breakdown next to the counts.","Waffle","Just show the second waffle","CDR: Could go right from “And both were written and performed by Taylor Swift…” to “Let’s explore how rare it is for women to write songs for men to perform.” Stuff in between might not be necessary.","Bubble Chart","Make it table","Search","% filter by percent women?","","Data Viz:","I’m debating whether we need to open up with the first image of songwriters in 2022. Do you think we need to visualize that?","CDR: Why not just start with “In 2022, 42 songs cracked the top 5 of the Billboard…” I actually don’t think the Annenberg context adds anything.","Does the counter make sense (the first major scrollytelling thing that counts up)? How do you think it could be improved?","CDR: I love the counter. I think it would be nice when you got to the end and the counter stopped that it showed the percentage breakdown next to the counts.","Does the waffle chart flow make sense? I was thinking about cutting one of these, but we want to hit the point of #1) only 13 songs written by women during 2000-2022 (which summarizes the intro) and #2) the performer/songwriter insight, which requires a 1958-2022 dataset. Can you think of a way to make this simpler/better?","RS : choose one waffle—not two.","CDR: Could go right from “And both were written and performed by Taylor Swift…” to “Let’s explore how rare it is for women to write songs for men to perform.” Stuff in between might not be necessary.","The final chart is a doozy, meant to be an explorer of all the data. Any thoughts on how it’d be easier to follow?","RS: make it a table, data tool. Spark line or histogram at top.","JD: Search for person or provide people with notable names in buttons to highlight… maybe also filter by % of women","CDR: I like a search idea","Story","I’ve been thinking a lot about this quote, “For example, you go see a comedian and at 1 hour and 10 minutes and you love the guy. But at 1 hour and 30 minutes, [you are thinking] 'eh, I thought he was never gonna finish.' [That extra 20 minutes and] you walk out with a whole different feeling. It's a small amount of too much [that can negatively influence your perception]. Too much cake. Too much of anything.” What sections, if you were to cut anything, would you remove first? What seems unneeded, boring, or superfluous?","CDR: I think all the scrolly stuff moves nicely. Might want to tighten up the copy at the end where there are a few paragraphs.","Design","What small changes to the design aesthetic (color, fonts, shapes) would improve things significantly?","JD: The illustrations seem to show women performers (which in this case are ALSO songwriters), but it might read as more teen bop-y and only show the forward facing side of songwriter,","RS: feel like normal square waffle is better than diamond for legibility","CDR: I agree that we should turn down the pink and diva stuff. I feel like the pop diva is the stereotype of female musicians that we are trying to address here. We might not want to embrace it. We could move the aesthetic to focus more on songwriter visuals rather than performer visuals","What design elements do you love?","definitely feels cohesive","What design elements feel like they could use more iterations/passes?","RS: it feels a little too 80s glam rock to me, which i think is largely the color choices/women silhouette imagery","Misc:","What might significantly improve the quality of the reader’s experience?","Design","We need to move away from Pink and Red Blue","Spotlight is going to be tough to pull off in code—love the idea though","The noise pattern—I would love that if I can get it","Don’t love the opening silhouette of the head—we should cut.","I like the shapes—wonder if we can animate these lightly.","Really like the title design (but isn’t going to be a11y friendly)","It could be! If each part is separate. Text is in the dom. Bubble outline is SVG or image. And texture is overlay/blend mode.","","Story","Feel like we need to acknowledge non-binary persons somewhere.","I agree about cutting the first waffle chart, but to replace that, I kind of want the intro to start super small, like with a single writers room for a song. Something like “This is what the average songwriting team looks like in 2022… 8 people (more than it used to be?), 6 men / 2 women (whatever it is)... the vast majority of teams include at least 1 man… in 2022, only 1 was written exclusively by women, Running Up that Hill”. And throughout you’re seeing illustrations of people in a room getting swapped in and out to match the numbers. I want to feel what a single room looks/feels like before we get to the zoomed out walls of mmfmfmfmffmf.","A slightly different way in, show 5 different writers rooms with illustrations for well known songs and be like “what do these have in common? There’s at least one man in the room” (kind of like the intro to Jan’s country radio piece). Then “in 2022, only 1 song was written exclusively by women…”","I like the counter!","I think you can cut the first waffle chart and instead just say “to recap the results for the last 22 years…” and just show the dozen or so songs written by all women. BUT, it is kind of nice to introduce that graphic + the zoom in thing for when we get to the second one. So I could go either way.","+1 to Russell’s point about making the final explorable more of a data table style. In my mind, I wouldn’t necessarily use this for very long if I was just reading it, but maybe if I wanted to use the data for something else, it would be nice to be able to get it here","Since your first big viz, and most of the charts are where each block is a song, it is a little confusing to start out with this being each block is a person.","Shift in data set from people to songs—so start with first 2021 data point…","Thin lines…could start with 2022…then expends to look like everything","Counter: I like the counter. Maybe there’s some sort of small bar chart, sparkling style next to the text that also grow.","Waffle chart: 1 chart with full data, not the intermediary step","start with second big scrolly chart - feeling it through scroll/counter is more captivating and less academic","final chart: feels more like a data table/csv file, not sure i would use it","I think the women should be on the bottom of the histogram over time chart so that is the focal part/easier to compare","Categories should have priority for only women and others should be tertiary.","If the point is to see the percent over time, then a toggle to normalize so they all take up full height"],"A":"1, 2, 3, 4, 5","B":"1958-2022","C":"1958-2022","D":"All Men, All Women, All Non-Binary Persons, At Least One Man, At Least One Woman, At Least One Non-Binary Person, Majority Men, Majority Women, Majority Non-Binary Persons, At Least One Man and One Woman, Anyone","E":"All Men, All Women, All Non-Binary Persons, At Least One Man, At Least One Woman, At Least One Non-Binary Person, At Least One Man and One Woman, Anyone","intro":[{"type":"text","value":"In 2022, hit songs had 6 songwriters on average: <span class=man-color-text>5 men</span> and <span class=woman-color>1 woman</span>."},{"type":"text","value":"But the average conceals a remarkable fact about the 42 songs that cracked the Top 5 of the Billboard Hot 100."},{"type":"text","value":"While half of the songs had a songwriting team of all men…"},{"type":"text","value":"Only one had a songwriting team of all women."}],"dataNote":"Songwriters were categorized as man, woman, or nonbinary using interviews, obituaries, official biographies, and social media, along with entries on Discogs and Wikipedia.<br><br>Read more in the <a href=#note>methodology</a>.","preLongScroll":[{"type":"text","value":"That one song - Kate Bush’s “Running Up that Hill (A Deal with God)” - was written in 1985 and only saw a resurgence because it was featured in the popular Netflix show <i>Stranger Things</i>."},{"type":"text","value":"How often has a top 5 hit been written <i>only</i> by women in the last 10 years? It’s likely rarer than you think."}],"longScrollHeadline":"The Songwriters for Every Top 5 Hit, by Year","longScroll":[{"0":"In 2021, there was one: <span class=woman-color>Taylor Swift’s “All Too Well,”</span> a song originally written by Swift with Liz Rose in 2012.","1":"In 2020, there was another. Toni Watson, known as Tones and I, wrote her own hit <span class=woman-color>“Dance Monkey.”</span>","2":"But there were none in 2019…","3":"or 2018…","4":"or 2017…","5":"or 2016…","6":"or 2015…","7":"or 2014…","8":"or 2013…","9":"or 2012…","10":"or 2011…","11":"Wait! <span class=woman-color>Here are 2…</span>"}],"postLongScroll":[{"type":"text","value":"And both were written and performed by Taylor Swift. This isn’t shocking for two reasons. First, hit songs written by women without men are not common. Second, when women do write a hit without a man also sharing credit, they often end up performing the song themselves."}],"hed":"Women are superstars on stage but still rarely get to write songs","dek":"The Gender Breakdown of Songwriting Teams","byline":"By Chris Dalla Riva, Illustrations by Ashley Cai","preWaffle":[{"type":"text","value":"Let’s explore how rare it is for women to write songs for men to perform. First, we’ll look at every hit song since the start of the Billboard Hot 100 in 1958."}],"waffleHed":"2,272 of 3,077 (74%) songs were written entirely by an <span class=\"man-color-text\">all-men songwriting team.","waffleDek":"Every Top 5 Hit, 1958-2022, Broken Down by Songwriting Team Gender","waffle":[{"type":"text","value":"Only 118 of the 3,077 (3.8%) top 5 hits were written exclusively by women.$$$But who performed those 118 songs?"},{"type":"text","value":"In almost all cases, women. Only 13 of those 118 were performed exclusively by men."},{"type":"text","value":"Men almost never perform songs written exclusively by women.<br><br>Even if we expand our search to Top 5 hits written exclusively by women and performed by mixed-gender groups, that list of songs only grows to 29."},{"type":"text","value":"If we look at the 118 songs written exclusively by women again, you’ll notice something else: the women who wrote more than half of these songs were also vocalists in the performing groups."}],"postWaffle":[{"type":"text","value":"Women singing the songs that they wrote might seem like a trifling detail, but it actually suggests something more vital: you cannot talk about the history of music without talking about men actively limiting the musical activities that women were allowed to participate in, <a href=https://www.vice.com/en/article/wxnd89/sexual-harassment-music-industry target=_blank>sometimes</a> <a href=https://people.com/tina-turner-recalled-escaping-ike-turner-abusive-marriage-1981-people-interview-7503995 target=_blank>via</a> <a href=https://nypost.com/article/inside-ronnie-spectors-sick-marriage-to-murderer-phil-spector/ target=_blank>physical</a> <a href=https://www.buzzfeed.com/kaylayandoli/famous-women-mistreated-by-music-industry target=_blank>or</a> <a href=https://www.theguardian.com/music/2020/aug/06/detail-music-producer-sexual-assault-charges-arrest target=_blank>sexual</a> <a href=https://www.theguardian.com/commentisfree/2022/may/03/metoo-music-industry-gatekeepers-women-abuse target=_blank>violence</a>."},{"type":"text","value":"From a nameless male author in 1860 <a href=https://core.ac.uk/download/pdf/40043849.pdf target=_blank>being disturbed</a> by women having to straddle a cello in order to play it to composer Gustave Kerker <a href=https://www.wqxr.org/story/stereotyping-instruments-why-we-still-think-some-are-for-boys-others-for-girls/ target=_blank>expressing his distaste</a> for how certain instruments distorted female faces to critic George Upton <a href=https://womeninmusic.voices.wooster.edu/wp-content/uploads/sites/123/2017/12/Upton-Woman-in-Music-15-32.pdf target=_blank>writing in his book</a> <i>Woman in Music</i> that women’s emotions made them great song interpreters (i.e., vocalists) but not great songwriters, men have continually tried to define what is appropriate for women to do in music."},{"type":"text","value":"When you listen to women who have worked in the industry, you’ll see that these attitudes have persisted. In an interview with Carol Connors, a songwriter who worked on a number of films including <i>Rocky</i> and <i>The Rescuers</i>, she described how, “It was very hard to break into the business without working with a man.” That’s why many women songwriters of the 1960s and 1970s often wrote with their husbands or boyfriends."},{"type":"text","value":"More recently, Sophia Somajo, a co-writer on Britney Spears’s number one hit “3”, <a href=https://www.popjustice.com/articles/sophia-somajo-is-your-private-dancer target=_blank>noted in 2018</a> that, “Being young and a woman [she] could only be a singer, and that was it.” She wasn’t trusted as a writer until she first proved herself as a vocalist."},{"type":"text","value":"The data reflects these experiences. According to a <a href=https://assets.uscannenberg.org/docs/aii-inclusion-recording-studio-jan2023.pdf target=_blank>report by USC’s Annenberg Inclusion Initiative</a>, women represented between 11-14% of songwriters from 2012 to 2022, a range that hasn't changed much in 60 years."}],"lineChartHed":"In 2022, Top 5 Billboard songs had 228 songwriting credits, but only <span class=\"woman-color\">33 were women</span> (14% of the total).","lineChartDek":"The 8,223 songwriting credits of Top 5 Hits, 1958-2022","conclusion":[{"type":"text","value":"It's also not just songwriting. That same study by USC’s Annenberg Inclusion Initiative found that women are underrepresented as some of the most powerful voices in the music industry: artists, songwriters, and producers. This imbalance then translates to awards, accolades, and who gets celebrated for their work. In the last decade, only 13.9% of Grammy nominees from the biggest categories (Record of the Year, Album of the Year, Song of the Year, Best New Artist, and Producer of the Year) were women."},{"type":"text","value":"Below, we provide you with a tool to sift through the artist and songwriter gender data that we gathered. You will quickly see that women are still actively impeded from songwriting at the highest levels of the pop world, and that women of color face even more impediments."},{"type":"text","value":"As you use this tool, also note the presence of non-binary songwriters. Though we focus on women in this piece, we did our best to capture non-binary songwriters too."}],"note":[{"type":"text","value":"Data Note: All of our data is publicly available <a href=https://docs.google.com/spreadsheets/d/1onjtF60H4P63U4DRSwSap033DS8yBAvFZ69JaVV_Q5s/edit#gid=0 target=_blank>here</a>. The Billboard Hot 100 has been the premiere pop music chart in the United States since August 1958. Though the chart began by just looking at radio airplay and sales, it now includes digital downloads, streams, and so much more."},{"type":"text","value":"Writing credits were compiled using a variety of sources, such as <a href=https://repertoire.bmi.com/>BMI Songview</a>, Discogs, Wikipedia, Tidal, and the Whitburn project. Songwriting credits often change or conflict depending on source, and we deferred to BMI, when possible, as the official source."},{"type":"text","value":"Gender data was compiled by looking at pronouns and gendered language used in multiple sources, including interviews, obituaries, official biographies, and social media, along with entries on Discogs and Wikipedia."},{"type":"text","value":"Songwriters were categorized into three groups: “women” (she/her pronouns or feminine language), “men” (he/him pronouns or masculine language), and “non-binary” (they/them pronouns, gender neutral/nonconforming language, or publicly identifies as non-binary or gender fluid). Pronouns and gendered language don’t directly map to gender, so in cases where public gender was not clear we looked for explicit statements from songwriters about how they defined their gender."},{"type":"text","value":"In approximately 150 cases (among over 6,000 songwriters), we did not find any explicit evidence of gender based on pronouns or publicly available information. In those cases we made probable guesses based on photos and name (this is available in our public data <a href=https://docs.google.com/spreadsheets/d/1onjtF60H4P63U4DRSwSap033DS8yBAvFZ69JaVV_Q5s/edit#gid=0 target=_blank>here</a>). Moreover, in one instance we were unable to identify a songwriter’s gender (also noted in the dataset)."},{"type":"text","value":"The gender data here has limitations: it only captures how a songwriter publicly defines their gender—not how they do so personally, privately, or outside of the confines of the music industry or society’s rigid prescriptions, especially in the earlier years of this data. It is also limited to a single point in time: how a songwriter presently identifies, which does not account for the complexity and fluidity of gender or any historical differences."},{"type":"text","value":"This is an imperfect method, but by using how songwriters define their gender in public, we can see important societal and structural trends within the music and songwriting industry—an industry that, like much of society, is built around cisgender men and excludes other marginalized communities."},{"type":"text","value":"We recognize the responsibility that comes with this data. If you find any errors in <a href=https://docs.google.com/spreadsheets/d/1onjtF60H4P63U4DRSwSap033DS8yBAvFZ69JaVV_Q5s/edit#gid=0 target=_blank>the data</a> for gender, songwriting credits, or names, please reach out (or leave a comment in the Google Doc) and we will issue a correction."}]}