{"ignore":["I think the labels here are too overwhelming and we should just have “only men” and “only women”","I still need to address your feedback on the box chart around performance and flow of that part.","There’s still a ton of data updating to do.","The long scroll needs a legend.","Mobile still needs to get done.","Wire up copy doc to the code","On the chart with boxes, it’s unclear who the writer is vs. the artist (pen icon might be too vague).","On the chart with boxes, names will be illegible on mobile.","Bug here","Kill first chart","Begin with in 2022—42 songs","This is what the average songwriting team looks like in 2022… 8 people (more than it used to be?), 6 men / 2 women (whatever it is)... the vast majority of teams include at least 1 man… in 2022, only 1 was written exclusively by women, Running Up that Hill”. And throughout you’re seeing illustrations of people in a room getting swapped in and out to match the numbers. I want to feel what a single room looks/feels like before we get to the zoomed out walls of mmfmfmfmffmf.","A slightly different way in, show 5 different writers rooms with illustrations for well known songs and be like “what do these have in common? There’s at least one man in the room” (kind of like the intro to Jan’s country radio piece). Then “in 2022, only 1 song was written exclusively by women…”","* Counter","I love the counter. I think it would be nice when you got to the end and the counter stopped that it showed the percentage breakdown next to the counts.","Waffle","Just show the second waffle","CDR: Could go right from “And both were written and performed by Taylor Swift…” to “Let’s explore how rare it is for women to write songs for men to perform.” Stuff in between might not be necessary.","Bubble Chart","Make it table","Search","% filter by percent women?","","Data Viz:","I’m debating whether we need to open up with the first image of songwriters in 2022. Do you think we need to visualize that?","CDR: Why not just start with “In 2022, 42 songs cracked the top 5 of the Billboard…” I actually don’t think the Annenberg context adds anything.","Does the counter make sense (the first major scrollytelling thing that counts up)? How do you think it could be improved?","CDR: I love the counter. I think it would be nice when you got to the end and the counter stopped that it showed the percentage breakdown next to the counts.","Does the waffle chart flow make sense? I was thinking about cutting one of these, but we want to hit the point of #1) only 13 songs written by women during 2000-2022 (which summarizes the intro) and #2) the performer/songwriter insight, which requires a 1958-2022 dataset. Can you think of a way to make this simpler/better?","RS : choose one waffle—not two.","CDR: Could go right from “And both were written and performed by Taylor Swift…” to “Let’s explore how rare it is for women to write songs for men to perform.” Stuff in between might not be necessary.","The final chart is a doozy, meant to be an explorer of all the data. Any thoughts on how it’d be easier to follow?","RS: make it a table, data tool. Spark line or histogram at top.","JD: Search for person or provide people with notable names in buttons to highlight… maybe also filter by % of women","CDR: I like a search idea","Story","I’ve been thinking a lot about this quote, “For example, you go see a comedian and at 1 hour and 10 minutes and you love the guy. But at 1 hour and 30 minutes, [you are thinking] 'eh, I thought he was never gonna finish.' [That extra 20 minutes and] you walk out with a whole different feeling. It's a small amount of too much [that can negatively influence your perception]. Too much cake. Too much of anything.” What sections, if you were to cut anything, would you remove first? What seems unneeded, boring, or superfluous?","CDR: I think all the scrolly stuff moves nicely. Might want to tighten up the copy at the end where there are a few paragraphs.","Design","What small changes to the design aesthetic (color, fonts, shapes) would improve things significantly?","JD: The illustrations seem to show women performers (which in this case are ALSO songwriters), but it might read as more teen bop-y and only show the forward facing side of songwriter,","RS: feel like normal square waffle is better than diamond for legibility","CDR: I agree that we should turn down the pink and diva stuff. I feel like the pop diva is the stereotype of female musicians that we are trying to address here. We might not want to embrace it. We could move the aesthetic to focus more on songwriter visuals rather than performer visuals","What design elements do you love?","definitely feels cohesive","What design elements feel like they could use more iterations/passes?","RS: it feels a little too 80s glam rock to me, which i think is largely the color choices/women silhouette imagery","Misc:","What might significantly improve the quality of the reader’s experience?","Design","We need to move away from Pink and Red Blue","Spotlight is going to be tough to pull off in code—love the idea though","The noise pattern—I would love that if I can get it","Don’t love the opening silhouette of the head—we should cut.","I like the shapes—wonder if we can animate these lightly.","Really like the title design (but isn’t going to be a11y friendly)","It could be! If each part is separate. Text is in the dom. Bubble outline is SVG or image. And texture is overlay/blend mode.","","Story","Feel like we need to acknowledge non-binary persons somewhere.","I agree about cutting the first waffle chart, but to replace that, I kind of want the intro to start super small, like with a single writers room for a song. Something like “This is what the average songwriting team looks like in 2022… 8 people (more than it used to be?), 6 men / 2 women (whatever it is)... the vast majority of teams include at least 1 man… in 2022, only 1 was written exclusively by women, Running Up that Hill”. And throughout you’re seeing illustrations of people in a room getting swapped in and out to match the numbers. I want to feel what a single room looks/feels like before we get to the zoomed out walls of mmfmfmfmffmf.","A slightly different way in, show 5 different writers rooms with illustrations for well known songs and be like “what do these have in common? There’s at least one man in the room” (kind of like the intro to Jan’s country radio piece). Then “in 2022, only 1 song was written exclusively by women…”","I like the counter!","I think you can cut the first waffle chart and instead just say “to recap the results for the last 22 years…” and just show the dozen or so songs written by all women. BUT, it is kind of nice to introduce that graphic + the zoom in thing for when we get to the second one. So I could go either way.","+1 to Russell’s point about making the final explorable more of a data table style. In my mind, I wouldn’t necessarily use this for very long if I was just reading it, but maybe if I wanted to use the data for something else, it would be nice to be able to get it here","Since your first big viz, and most of the charts are where each block is a song, it is a little confusing to start out with this being each block is a person.","Shift in data set from people to songs—so start with first 2021 data point…","Thin lines…could start with 2022…then expends to look like everything","Counter: I like the counter. Maybe there’s some sort of small bar chart, sparkling style next to the text that also grow.","Waffle chart: 1 chart with full data, not the intermediary step","start with second big scrolly chart - feeling it through scroll/counter is more captivating and less academic","final chart: feels more like a data table/csv file, not sure i would use it","I think the women should be on the bottom of the histogram over time chart so that is the focal part/easier to compare","Categories should have priority for only women and others should be tertiary.","If the point is to see the percent over time, then a toggle to normalize so they all take up full height"],"A":"1, 2, 3, 4, 5","B":"1958-2022","C":"1958-2022","D":"All Men, All Women, All Non-Binary Persons, At Least One Man, At Least One Woman, At Least One Non-Binary Person, Majority Men, Majority Women, Majority Non-Binary Persons, At Least One Man and One Woman, Anyone","E":"All Men, All Women, All Non-Binary Persons, At Least One Man, At Least One Woman, At Least One Non-Binary Person, At Least One Man and One Woman, Anyone","intro":[{"type":"text","value":"In 2022, hit songs had, on average, 6 songwriters: <span class=woman-color>1 woman</span> and <span class=man-color-text>5 men</span>."},{"type":"text","value":"But the average conceals a remarkable fact about the 42 songs that charted in top 5 of Billboard Hot 100…"},{"type":"text","value":"Half of the songs had a songwriting team of all men."},{"type":"text","value":"Only one song had a songwriting team consisting of just women."}],"preLongScroll":[{"type":"text","value":"That one song - Kate Bush’s “Running Up that Hill (A Deal with God)” - was written in 1985 and only saw a resurgence because it was featured in the popular Netflix show <i>Stranger Things</i>."},{"type":"text","value":"Songs written by <i>just</i> women are rarer than you think. How often do you think a top 5 hit has been written just by women in the last 10 years?"}],"longScrollHeadline":"The Songwriters for Every Top 5 Hit, by Year","longScroll":[{"0":"In 2021, there was one: <span class=woman-color>Taylor Swift’s “All Too Well,”</span> a song written by Swift with Liz Rose..","1":"A year prior, Toni Watson, known as Tones and I, wrote her own hit, <span class=woman-color>“Dance Monkey.”</span>","2":"But there were none in 2019","3":"or 2018…","4":"or 2017…","5":"or 2016…","6":"It’s been 5 years. How long is this going to take???","10":"This is getting ridiculous.","11":"Wait! <span class=woman-color>Here are 2…</span>"}],"postLongScroll":[{"type":"text","value":"And both were written and performed by Taylor Swift. This isn’t shocking for two reasons. First, hit songs written by women without any male co-writers are rare. Second, when women do write a hit without a man also sharing credit, they often end up performing the song themselves."}],"hed":"Women are superstars on stage but still rarely get to write songs","dek":"The Gender Breakdown of Songwriting Teams","byline":"By Chris Dalla Riva, Illustrations by Ashley Cai","preWaffle":[{"type":"text","value":"Let’s explore how rare it is for women to write songs for men to perform. First, we’ll look at every hit song since the start of the Billboard Hot 100 in 1958."}],"waffleHed":"About 1,502 of 3,082 Songs are written entirely by an <span class=\"man-color-text\">all-men songwriting team.","waffleDek":"Every Top 5 Hit, 1958-2022, Broken Down by Songwriting Team Gender","waffle":[{"type":"text","value":"Only 187 of the 3,082 top 5 hits were written exclusively by women."},{"type":"text","value":"Of those 187, only 13 were performed exclusively by men."},{"type":"text","value":"Even if we expand our search to top 5 hits written exclusively by women and performed by groups with men and women, that list of songs only grows by 16."},{"type":"text","value":"Note how women who wrote more than half of these songs were vocalists in the performing groups."}],"postWaffle":[{"type":"text","value":"Women often singing the songs that they wrote might seem like a trifling detail, but it actually suggests something more vital: You cannot talk about the history of music without talking men actively limiting the musical activities that women were allowed to participate in."},{"type":"text","value":"In 1860, an unknown author was disturbed that female cellists would have to straddle their instruments: “Lady-fiddlers we are tolerably well accustomed to, but the attitude of a lady grasping with all her limbs a violoncello is one to the grotesqueness of which usage has not yet reconciled us.” A few decades later, composer Gustave Kerker expressed his distaste for how certain instruments distorted female faces: “Women cannot possibly play brass instruments and look pretty, and why should they spoil their good looks?” Around the same time, critic George Upton wrote in his book Woman in Music about how women’s emotions made them great song interpreters (i.e., vocalists) but prevented them from writing great works."},{"type":"text","value":"Upton’s comment is an example of a pernicious piece of sexism that still lives on more than a century later. Before women can be taken seriously as songwriters, they must first prove that they are capable vocalists."},{"type":"text","value":"* Sophia Somajo, who co-wrote Britney Spears’s number one hit “3”, noted in 2018 that “Being young and a woman [she] could only be a singer, and that was it.” She wasn’t trusted as a writer until she first proved herself as a vocalist.[a][b]"},{"type":"text","value":"A century-plus later, it’s clear that there is still so much progress to be made."}],"lineChartHed":"In 2022, <span class=\"woman-color\">women</span> represented 14% of songwriters among Top 5 Billboard hits, a number that hasn't in changed 60 years.","lineChartDek":"The 8,023 songwriters of a top 5 hit, 1958 - 2022","conclusion":[{"type":"text","value":"Below, we provide you with a tool to sift through the artist and songwriter gender data that we gathered. You will quickly see that women are still actively impeded from songwriting at the highest levels of the pop world, and that women of color face even more impediments."}],"note":[{"type":"text","value":"Data Note: The Billboard Hot 100 has been the premiere pop music chart in the United States since August 1958. Though the chart began by just looking at radio airplay and sales, it now includes digital downloads, streams, and so much more. Songwriter and artist gender data was compiled from the pronouns used in interviews, obituaries, and official biographies, along with entries on Discogs and Wikipedia."}],"a":[],"b":[]}